{"/blog/es/about/":{"data":{"":"En el blog vas a encontrarte con reflexiones y aprendizajes sobre mi vida en general.\nNo pretendo ser ejemplo de nada ni nadie, las opiniones que dejo acá son mías, espero no ofender a nadie con ellas.\nMi nombre es Luis Pedro –luispe– tengo 38 años al momento de escribir esta publicación nací y crecí en Gonnet, una localidad de La Plata, BsAs, Argentina. De mi infancia conservo a una tonelada de amigos con los cuales ya compartimos 35 años, ahora que lo escribo es una locura. Son mi guía y mi cable a tierra, si soy lo que soy es en parte gracias a ellos y a mi familia ❤️\nDesde muy pequeño jugué al fútbol en el club Gimnasia y Esgrima de La Plata, después de muchos años cuando estaba en la 7ma división tuve que tomar la decisión de si el fútbol iba a ser mi destino profesional o un deporte, la decisión fue que sea un deporte, este capítulo se merece una publicación aparte.\nAl terminar la secundaria en La Plata estudié y me recibí en el conservatorio Gilardo Gilardi y a la par también me recibí en un terciario de jazz (EMU).\nDespués de varios discos, recitales y ensayos decidí dar un giro a mi vida y comencé a estudiar en la UTN (FRLP) la carrera de ingeniería en sistemas.\nEn 2012 comencé a trabajar en tecnología y gracias a ella me hice de varios amigos que aún y por fortuna conservo, no voy a nombrarlos porque temo olvidarme de más de una o de uno.\nLuego de varios años y ahora que lo escribo 38 y contando, es un buen momento para escribir, lo considero un buen canal para canalizar mis sensaciones que se suma a un buen vino, la música mi familia y amigos.\nEntonces, acá va… ¡espero que lo disfrutes!"},"title":"Hola 👋🏼"},"/blog/es/posts/career/":{"data":{"":"Los aniversarios, puede ser un cumpleaños, fin año o cualquiera sea, en general lo llevan a uno llevan a reflexionar.\nEste caso no sería la excepción, ¿cuál es el aniversario?, hace menos de un mes cumplí un año en mi actual empresa (Pomelo), el 29 de agosto del 2022 hicieron públicas las promociones en la empresa, formo parte de las personas a las que ascendieron, quería escribir algunas conclusiones que me llevo de estos más 365 días, dos equipos y un ascenso.","con-ustedes-a-la-guerra-con-un-escarbadientes#Con ustedes, a la guerra con un escarbadientes":"Hablé de mi primera etapa en Pomelo, pasemos a la segunda, “Migración al equipo de Infraestructura”.\nDe enero a esta parte y desde el minuto cero Juanjo y Gus y conociéndome, diría que nada, me dieron el espacio para crear un espacio de debate y repreguntas. Escucharon mis propuestas, las hicieron suyas, y entre todos las llevamos adelante, me hicieron partes de las suyas las tome como propias y así rodeado de una pila de personas con una calidad humana de otro planeta hicimos y estamos haciendo cosas increíbles.\n¿Cuál es el punto de todo esto?, que ascender no sea la principal o única meta, generar confianza a tu alrededor es incontable de veces más importante y es, al menos en los valores que persigo y busco, infinitamente superior a cualquier puesto que ocupemos u obtengamos.\nPor ahora no quiero aburrir ni extenderme, pronto voy a escribir sobre los otros dos pilares que siento indispensables para transitar la vida, humildad y respeto.","confianza#Confianza":"Voy a intentar explicar que significa para mí este pilar.\nEn una de mis primeras publicaciones donde hablo sobre errores y aprendizajes, hablo sobre que ascender no debería ser la única o principal meta hay cosas muchísimo, pero muchísimo más importantes y la confianza es una de ellas.\nOk luispi, ¿pero qué tiene que ver con la confianza?, alla vamos.","inicios#Inicios":"Mi primer acercamiento a Pomelo fué por medio de Maru, ya nos conocíamos, Maru fué quien hizo el proceso de hiring cuando entré en MercadoLibre, luego estuvimos cerca de reencontrarnos en Naranja X, pero bien sirvió el impasse para reencontrarnos profesionalmente en Pomelo, esto lo cuento justamente por el término de confianza.\n¿Creen que Maru hubiese confiado en mí no solo una, sino dos veces?, yo creo que no, es una persona absolutamente admirable en construir equipos de tecnología, y esa confianza que mutuamente nos tenemos hace que:\nMaru vuelva a confiar en mí una y otra vez y vuelva a convocarme. De mi lado tomar esa confianza depositada y construir (o intentar hacerlo) el mejor contexto de trabajo posible.","pilares#Pilares":"Los que me conocen, sea en lo laboral o la vida personal, me escuchan hablar sobre tres principios, con los que trato de movilizarme y busco a mi alrededor:\nConfianza Humildad Respeto","reencuentro-y-desencuentro#Reencuentro y desencuentro":"En los más 365 días que llevo en Pomelo trabaje casi la mitad de tiempo en el equipo del Procesador, me reencontré con caras conocidas y conocí algunas nuevas, ya voy a nombrarlas, primero la anécdota.\nEn el Procesador estuve poco más de 5 meses, cumplimos el hito (locura) de tener en marcha el procesador y luego mediando enero de 2022 me mude al equipo de infra. Acá se jugaron dos pilares, confianza y respeto, ¿por qué digo esto?, los chicos supieron para donde quería dirigir mi carrera y me apoyaron al 100%.\nNo obstante 7 meses después me demostraron que son personas en las cuales voy a confiar infinitamente más allá de Pomelo, estas personas son: Brizi, Dami y Nico, no voy a contar los pormenores ellos saben a qué me refiero, pero quería agradecerles públicamente ❤️."},"title":"Aniversarios"},"/blog/es/posts/graceful-shutdown/":{"data":{"":"En esta publicación quiero compartir un tema que suele pasarse por alto cuando desarrollamos aplicaciones en Go: graceful shutdown.\nParece un detalle, pero no lo es. Si trabajás con servidores HTTP, workers, consumidores de colas o cualquier proceso concurrente con goroutines, manejar correctamente el apagado puede evitar pérdidas de datos, conexiones colgadas o comportamientos erráticos.","anti-patrón#Anti patrón":"Imaginemos el siguiente código:\npackage main import ( \"log\" \"net/http\" ) func main() { http.HandleFunc(\"/\", func(w http.ResponseWriter, r *http.Request) { w.Write([]byte(\"hola mundo\")) }) log.Println(\"server listening on :8080\") http.ListenAndServe(\":8080\", nil) } A simple vista funciona. Pero si ejecutamos el binario y lo detenemos con ctrl + c, el proceso muere abruptamente.\nCualquier request en curso se corta, los recursos abiertos (conexexiones, archivos, etc.) no se liberan y no hay oportunidad de realizar tareas de limpieza.","casos-borde#Casos borde":"Bloqueos en goroutines: si una goroutine espera en un canal que nadie cierra, el shutdown no completa.\nSolución: asegurarse de que todos los canales se cierren en la secuencia correcta. Timeout insuficiente: si el context.WithTimeout es demasiado corto, puede abortar tareas legítimas. Ajustalo según la carga real del sistema. Uso de defer dentro de goroutines: recordá que los defer se ejecutan cuando la goroutine retorna. Si no retornan, nunca se ejecutan.","conclusiones#Conclusiones":"El graceful shutdown no es opcional; es parte esencial de la salud de un servicio en producción.\nUsar contextos correctamente y respetar los tiempos de cierre es una forma simple de evitar bugs difíciles de reproducir y mejorar la estabilidad de nuestras apps.\nPara no aburrirte y por el momento hagamos una pausa.\n¡Hasta pronto! 👋🏽","el-cuidado-con-las-goroutines#El cuidado con las goroutines":"Acá viene el punto delicado.\nSi además del servidor tenés goroutines de background —por ejemplo workers que consumen de una cola o procesan tareas—, debés asegurarte de que también respeten el contexto de cancelación.\nUn error común es lanzar goroutines sin una forma de detenerlas:\ngo func() { for { processJob() // nunca termina } }() El resultado: cuando tu servidor apaga, esta goroutine sigue viva… o muere abruptamente, dejando el trabajo a medias.\nEl enfoque correcto:\nctx, cancel := context.WithCancel(context.Background()) defer cancel() go func(ctx context.Context) { for { select { case \u003c-ctx.Done(): log.Println(\"worker stopped gracefully\") return default: processJob() } } }(ctx) Cuando el proceso recibe una señal, cancel() se ejecuta y todas las goroutines escuchando ese contexto terminan ordenadamente.","fuentes-y-lecturas-recomendadas#Fuentes y lecturas recomendadas":"Go Blog: Go Concurrency Patterns — Context\\ Documentación oficial del paquete context\\ Documentación oficial del paquete os/signal\\ Documentación oficial del paquete net/http\\ Wiki oficial de Go: Signal Handling","preámbulo#Preámbulo":"El concepto de graceful shutdown no es nuevo. Se trata, simplemente, de darle tiempo a nuestra aplicación para que termine lo que está haciendo antes de morir.\nEl problema es que en Go solemos subestimar su complejidad. Por ejemplo, lanzamos un servidor HTTP y varias goroutines de background, y asumimos que con ctrl + c o un SIGTERM todo se apaga como por arte de magia.\nSpoiler: no. 😅","propuestaaprendizaje#Propuesta/aprendizaje":"La solución es implementar un graceful shutdown usando los paquetes context y os/signal.\npackage main import ( \"context\" \"log\" \"net/http\" \"os\" \"os/signal\" \"syscall\" \"time\" ) func main() { server := \u0026http.Server{Addr: \":8080\"} // Canal para escuchar señales del sistema stop := make(chan os.Signal, 1) signal.Notify(stop, os.Interrupt, syscall.SIGTERM) go func() { log.Println(\"server listening on :8080\") if err := server.ListenAndServe(); err != nil \u0026\u0026 err != http.ErrServerClosed { log.Fatalf(\"listen: %s \", err) } }() \u003c-stop // bloquea hasta recibir señal log.Println(\"shutdown signal received\") ctx, cancel := context.WithTimeout(context.Background(), 5*time.Second) defer cancel() if err := server.Shutdown(ctx); err != nil { log.Fatalf(\"server forced to shutdown: %v\", err) } log.Println(\"server stopped gracefully\") } Ahora, cuando el proceso recibe una señal (SIGTERM o SIGINT), se le da un tiempo (en este caso 5 segundos) para terminar las requests activas antes de cerrar."},"title":"Graceful shutdown y goroutines"},"/blog/es/posts/hexagonal-architecture/":{"data":{"":"Esta es la primera de una serie donde vamos a revisar diferentes patrones de desarrollo que errores cometí y cuál es en la actualidad y lo que entiendo hasta el momento, la mejor forma de aplicarlo.\nComo bien dice el título de la publicación hoy quiero hablar sobre arquitectura hexagonal.","comencemos#Comencemos":"Anti patrón\nAnotación en nuestro modelo de dominio e.g json\nUn error que solía cometer es tener las anotaciones json o gorm o cualquier anotación en el modelo de dominio.\nImaginemos que tenemos nuestro modelo /user/user.go con el siguiente contenido\ntype User struct { FirstName string `json:\"first_name\"` LastName string `json:\"last_name\"` } Antes de continuar leyendo te invito a que por unos segundos/minutos hagamos una reflexión de porque es un anti patrón.","preámbulo#Preámbulo":"Hace tiempo noto mucho “hype” en torno a la arquitectura hexagonal y me gustaría ser claro al respecto, no estoy en contra, mas bien todo lo contrario, me parece un excelente patrón.\nPero creo que caemos en el error de aplicar la recetas de publicaciones de “medium” y no solo terminamos con todas las capas de nuestro sistema acopladas sino que con nombres de packages al estilo “adapters” o “ports” y si hay algo hermoso en el lenguaje de Go(lang) es la intencionalidad en el nombre de un package.\n🗒️ Un buen nombre en el package hace que no sea necesario nada más para expresar la intencionalidad del mismo. Te comparto y recomiendo leer la siguiente publicación oficial, opinión personal, aplica para cualquier lenguaje.","propuestaaprendizaje#Propuesta/aprendizaje":"Nuestro modelo debería ser agnóstico a la capa de presentación y a la de datos, por lo tanto, no debería contener ninguna anotación. Deberíamos mapear los datos hacia nuestro modelo y viceversa, a continuación un ejemplo de como quedaría un controlador rest HTTP e.g.:\nuser/rest_controller.go\ntype UserDTO struct { FirstName string `json:\"first_name\"` LastName string `json:\"last_name\"` } func (ctrl *controller) toUserModel(userDTO *UserDTO) *User { return \u0026User{ FirstName:\tuserDTO.FirstName, LastName:\tuserDTO.LastName, } } func (ctrl *controller) toUserDTO(user *User) *UserDTO { return \u0026UserDTO{ FirstName:\tuser.FirstName, LastName:\tuser.LastName, } } Como podemos ver en el ejemplo anterior los métodos privados en el controlador rest mapean desde el data transfer object hacia el modelo de dominio cuando llamemos al servicio y viceversa.\nPor último quitamos las anotaciones en nuestro modelo user/user.go\ntype User struct { FirstName string LastName string } Todo bien luispi, ¿pero qué ganancia obtuvimos?\nAhora nuestro /user/user.go al no tener ninguna anotación no importa como presentemos o como obtengamos/persistamos los datos, nunca vamos a tocar el core/dominio de nuestra aplicación, ahora si podríamos afirmar que nuestro core/dominio es agnóstico a las capas de presentación o datos ganando flexibilidad, testabilidad, etc.\nPara no aburrirte y por el momento hagamos una pausa.\nPróximamente vamos a seguir con pequeñas publicaciones donde vamos a intentar repensar otros anti patrones.\n¡Que pase bien!"},"title":"Hexagonal Architecture"},"/blog/es/posts/interfaces-correct-use/":{"data":{"":"En la siguiente publicación quiero compartir un error común que solía cometer en mis proyectos en Golang. Y como bien dice el título y descripción hoy vamos a hablar de las interfaces.\nSeguramente se encuentren con algunas referencias a otra publicación que hice sobre arquitectura hexagonal, creo que parte del mal uso de las interfaces es la consecuencia de seguir a rajatabla publicaciones de “medium” y no tomarse el tiempo para entender el concepto subyacente.","conclusiones#Conclusiones":"Con estos cambios sutiles pero poderosos nuestros producer ahora tienen una enorme flexibilidad.\nPor último quiero agradecer a mi amigo y mentor morenojp que me compartió este anti patrón y me hizo repensar y mejorar, una vez más, en esto del desarrollo de software.\nPara no aburrirte y por el momento hagamos una pausa.\nPróximamente vamos a seguir con pequeñas publicaciones donde vamos a intentar repensar otros anti patrones.\n¡Hasta pronto! 👋🏽\nFuentes:\nwiki oficial de Golang go interfaces misuse","preámbulo#Preámbulo":"Si hay algo que tenemos que admitir en el ecosistema de Golang es el enrosque que a veces nos damos con algunas/varias cuestiones. Por dar un ejemplo en como nombrar las variables (que es un tema del que quiero hablar pronto) y en el caso de hoy con las interfaces.\nGolang tiene sus particularidades, pero se basa en muchos patrones ya conocidos en la industria. En el ecosistema de Go a veces complejizamos algunos patrones y caemos en “anti patrones”, en la siguiente publicación vamos a revisar un proyecto falso y refactorizarlo para hacer un buen uso de las interfaces.\nPara simplificar un poco la publicación vamos a acotar el caso de uso y lo reduciremos a la capa de servicio y repositorio.\nImaginemos que en la capa de repositorio nos encontramos con lo siguiente:\npackage repository import ( // pkg imports ) type Repository interface { Save(ctx context.Context, model *beer.Beer) (*beer.Beer, error) } type repository struct { // repository client and configs go here } func NewRepository() Repository { return \u0026repository{} } func (repo *repository) Save(ctx context.Context, model *beer.Beer) (*beer.Beer, error) { // previous logic here return repo.toModel(beerEntity), nil } Y en la capa de servicio lo siguiente:\npackage service import ( // pkg imports ) type Service interface { Create(ctx context.Context, model *Beer) (*Beer, error) } type service struct { repo Repository } func NewService(repo Repository) Service { return \u0026service{repo: repo} } func (svc *service) Create(ctx context.Context, model *Beer) (*Beer, error) { beer, err := svc.repo.Save(ctx, model) if err != nil { return nil, err } return beer, err } El anterior escenario es el que me encuentro comúnmente en los proyectos de Go y quiero comentarles que yo también supe cometer el mismo error.\nTodo bien luispi, ¿pero cuál es el error?\nLas interfaces en Go generalmente pertenecen al paquete que usa valores del tipo de interfaz, no al paquete que implementa esos valores. 🫠","propuestaaprendizaje#Propuesta/aprendizaje":"El paquete de implementación debe devolver tipos concretos (generalmente puntero o estructura): de esa manera, se pueden agregar nuevos métodos a las implementaciones sin requerir una refactorización extensa.\nCon esto en mente vayamos a los bifes\nEn primer lugar, ataquemos la capa de repositorio, como bien dice la nota anterior vamos a retornar una estructura y no la interfaz.\npackage repository import ( // pkg imports ) type Repository struct{ // repository client and configs go here } func NewRepository() Repository { return Repository{} } func (repo *Repository) Save(ctx context.Context, model *beer.Beer) (*beer.Beer, error) { // previous logic here return repo.toModel(beerEntity), nil } Repasemos el cambio.\nEn primer lugar, eliminamos la interfaz y ahora la función NewRepository() retorna la estructura Repository, y en segundo lugar agregamos a Repository el método save.\nTodo bien luispi, ¿pero qué ganamos con este cambio?\nComo no tenemos que cumplir con ningún contrato de interfaz no estamos atados a tener que implementar todos los métodos que tenga la misma.\nTenemos que pensar a este paquete como un productor (producer) y siempre tengamos como nota mental que los producer, de nuevo, retornan tipos concretos (generalmente un puntero o una estructura).\nAhora es el turno de editar la capa del consumidor (consumer), en este caso el service.\npackage service import ( // pkg imports ) type Repository interface { Save(ctx context.Context, beer *Beer) (*Beer, error) } type Service struct { repo Repository } func NewService(repo Repository) Service { return Service{repo: repo} } func (svc *Service) Create(ctx context.Context, beer *Beer) (*Beer, error) { createBeer, err := svc.repo.Save(ctx, beer) if err != nil { return nil, err } return createBeer, err } Repasemos el cambio.\nRealizamos varios cambios, en primer lugar declaramos la interfaz Repository y en la estructura Service inyectamos la interfaz para que pueda consumirse en los métodos del servicio.\nAl igual que con la capa de repositorio nuestro NewService() ahora retorna una estructura y no una interfaz.\nPor ultimo agregamos el método Create a nuestro Service."},"title":"Interfaces y \"copy paste\""},"/blog/es/posts/lightweight-container-image/":{"data":{"":"En la siguiente publicación voy a compartirles algunos consejos y buenas prácticas para desarrollar nuestras imágenes de container, como ejemplo vamos a crear una imagen para una app en Golang, pero los siguientes consejos aplican para cualquier lenguaje, ¡vamos!","comencemos#Comencemos":"Imaginemos que tenemos el siguiente Dockerfile para crear nuestra imagen de container e.g:\nDockerfile 1 2 3 4 5 6 7 8 9 10 FROM golang:1.18 WORKDIR /build COPY go.mod go.sum ./ RUN go mod download \u0026\u0026 go mod verify COPY . ./ RUN go build -o ./myapp ./path/to/main ENTRYPOINT [\"/myapp\"] Construyamos nuestra imagen docker build -t myapp:0.0.1 .\nSi listamos las imágenes que tengamos en nuestro host vamos a poder observar que el peso es de aproximadamente 968 MB\nWhat? 968 MB solo para disponibilizar un binario que pesa unos pocos megas?\nNOTA\nEn todas mis publicaciones vas a encontrarte con conceptos, la idea es que aprendamos y no copiemos y peguemos. Por dar un ejemplo RUN go build -o ./myapp ./path/to/main donde ./path/to/main debería estar el main de tu app de Golang","preámbulo#Preámbulo":"Perseguir que nuestras imágenes de container sean lo más reducida posible en cuanto a su peso (megabytes, gigabytes, etc.) no es una cuestión de gustos, nos ayuda en muchos aspectos, a continuación les comparto algunos:\nReduce gastos de storage en el registry que utilizamos para gestionar nuestras imágenes. Cuando tengamos que obtener la imagen para iniciar el container queda claro que mientras más liviana sea más rápido va a ser la inicialización del container, y con esto ganamos en dos puntos. Costos, y con costos nos referimos al uso del networking que utilicemos para obtener la imagen y luego inicializar el container. Velocidad en auto scaling, está claro que obtener una imagen de 20 MB versus una de 900 MB la primera, claro está, va a inicializarse con mayor velocidad. Por dar algunos ejemplos.","propuestaaprendizaje#Propuesta/aprendizaje":"","segunda-propuesta#Segunda propuesta":"La tecnología de container tiene una característica excelente, que para nuestro caso, nos va a ayudar a construir una imagen de container muy liviana, por si no lo sabías, estoy hablando de Multistage, te comparto la documentación oficial para que profundices sobre esta característica.\n¿En qué consiste Multistage?, se trata de construir imágenes por etapas pudiendo así compartir datos entre cada una de ellas y vamos a obtener una imagen final de un tamaño muy pequeño.\nLo primero que vamos a hacer es tener una primera etapa de build, donde vamos a construir el binario, y una segunda etapa donde vamos a dejarlo disponible para utilizarlo.\nManos a la obra, abramos y realicemos las siguientes modificaciones a nuestro Dockerfile.\nDockerfile 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 # First layer use to build a Golang binary FROM golang:1.18-alpine3.16 AS builder WORKDIR /build COPY go.mod go.sum ./ RUN go mod download \u0026\u0026 go mod verify COPY . ./ RUN go build -o ./myapp ./path/to/main # Final layer expose app to minimal docker image FROM alpine:3.16.0 COPY --from=builder /build/myapp /myapp ENTRYPOINT [\"/myapp\"] Como podemos observar la primera modificación consiste en taguear la primera etapa como build. Luego en la segunda y etapa final con la siguiente línea COPY --from=builder /build/myapp /myapp copiamos el binario desde la etapa que tagueamos como builder y lo disponibilizamos en una imagen alpine.\nSi listamos ahora nuestras imágenes podemos observar que pesa aproximadamente 9 MB, si si, escribi correctamente 9 megabytes 😎.\nPodríamos realizar una última optimización o buena práctica, pero creo que vale la pena dejarlo para otra publicación.\nPara no aburrirte y por el momento hagamos una pausa.\n¡Que pase bien! 👋🏽","vamos-con-la-primera-propuesta#Vamos con la primera propuesta.":"Siempre es una buena práctica usar imágenes -alpine, por convención en el universo de container cuando disponibilizamos una imagen -alpine estamos indicando al cliente que es una imagen reducida en tamaño y la que deberíamos utilizar en nuestro Dockerfile, entre otras cosas.\nBien, realicemos un pequeño cambio en nuestro Dockerfile y volvamos a construir nuestra imagen\nDockerfile 1 2 3 4 5 6 7 8 9 FROM golang:1.18-alpine3.16 WORKDIR /build COPY go.mod go.sum ./ RUN go mod download \u0026\u0026 go mod verify COPY . ./ RUN go build -o ./myapp ./path/to/main ENTRYPOINT [\"/myapp\"] Si prestamos atención el cambio fue sutil, pero efectivo, pasamos de FROM golang:1.18 a FROM golang:1.18-alpine3.16\nConstruyamos nuevamente nuestra imagen docker build -t myapp:0.0.2 .\nSi volvemos a listar las imágenes nos vamos a encontrar con que ahora la imagen myapp:0.0.2 pesa aproximadamente 331 MB\nReducimos, si las cuentas no fallan, 637 MB.\nEs una excelente “approach” pero repensemos. ¿Hace falta tener una imagen con todo Golang dentro del container pesando cerca de 331 MB para disponibilizar un binario que pesa unos cuantos megabytes?.\nLa respuesta es claramente, no."},"title":"El tamaño importa"},"/blog/es/posts/mistakes-and-learnings/":{"data":{"":"En nuestra sociedad en general y en tecnología en particular tenemos la extraña costumbre de publicar los aciertos (opinión de quien redacta, mal llamado caso de éxito) y pocas, por no decir nulas, las ocasiones donde se comparten los errores (opinión de quien redacta, mal llamado fracaso).\nComo estarás sospechando a continuación voy a compartir algunos errores, que aprendí de ellos y más aún cuanto crecí y entendí de la industria al compartirlos.","enseñanza-1#Enseñanza 1:":"Escribir un paso a paso, compartirlo, validarlo y re-validarlo antes de ejecutar nada\nMi primer desarrollo productivo fue en 2012 (?) aproximadamente, se trató de una web para una empresa que necesitaba publicar su catálogo de productos, enumero tecnologías para tener un poco de contexto:\ndigitalocean, recién salido, además de los droplets no se cuantos productos más tenía en cartera angular js (angular 1) creo que nodeJS para el backend Este desarrollo lo hice con quien es una de las personas que más respeto y admiro, Víctor De Grandis –Vitor–.\nMi experiencia configurando servidores era nula, tuve la delirante idea de decirle a Vitor:\nche amigo, ¿puedo configurar el servidor y después intentas romperlo?\nActo seguido me pongo a realizar varias configuraciones entre ellas me puse a jugar con los puertos, hasta que muy orgulloso le digo:\nVitor, probá a ver qué onda\nDespués de un rato me llega un mensaje,\namigo ¿puede ser que cerraste el puerto 22?\nHermoso, salí de la casa, cerré la puerta y tiré la llave a una laguna.\nComo la gente de digitalocean está preparada para personas como quien redacta, tiene una funcionalidad que si se accede desde la web (no tengo mucha idea como se resuelve por detrás) podes ejecutar una terminal en el navegador y acceder al droplet.\nConfigure de nuevo los puertos, y el resto medio que es historia.","enseñanza-2#Enseñanza 2:":"Documentar el conocimiento por más trivial que lo consideremos e invitemos a que el resto lo haga. Además de evitar varias reuniones de “transferencia de conocimiento” nos vamos a ahorrar varios arrobas, ¿te recuerda algo?\n@fulanito puede darte una mano\nEn otro equipo que tuve la fortuna de trabajar, pequeño en cantidad de personas, pero de las cuales aprendí mucho mucho de cada una de ellas, lamentablemente la aventura fue muy corta en tiempo.\nLo que sí me extrañó a medida que uno a uno se iba yendo gente del equipo es que perdíamos mucho conocimiento a punto tal de parar motores (literal) y estar semanas sin entregar funcionalidades a producción porque tuvimos que sentarnos a entender cómo dejar esa línea de código local y exponerla a internet.\n¿Qué errores detecte y que aprendí?\nDocumentar el conocimiento, por más trivial que lo consideremos, documentarlo.\nO acaso, y te invito a pensar durante unos segundos. ¿te encontraste una o más veces haciendo reuniones de “knowledge transfer” porque alguna persona estaba dejando el equipo?\n¿O acaso eras vos quien lo estaba dejando?","enseñanza-3#Enseñanza 3:":"Ascender no debería ser la única o principal meta, compartir y adquirir conocimiento debería ser la guía.\nEnseñanza 3 bis:\nPensar y realizar pruebas antes de implementar cualquier cosa es una guía fundamental para entender el comportamiento de nuestros sistemas o del conocimiento del dominio que tenemos hasta el momento. Siempre y repitamos, siempre, es una ganancia en el tiempo.\nPor último y en otro lugar que trabajé, conocí a una de las personas que mejor resuelve problemas, Juan Moreno, ¿qué es mejor para mí?, soluciones simples a problemas complejos.\nDespués de este pequeño paréntesis y dedicatoria a quien hoy es una de mis fuentes de consulta, referente y mentor, voy a intentar explicar la enseñanza número 3 y 3 bis.\nEn los tiempos prepandemia, solía –costumbre que aún conservo desde lo remoto– arrancar temprano, tener un par de horas “a solas” me permite focalizar y priorizar en la medida de lo posible las cosas que quiero y me comprometí a realizar.\nUna de esas mañanas y en consecuencia a una funcionalidad que estábamos desarrollando en el equipo el líder llegó un poco enojado (por ser amable) y agarró a los primeros que encontró del equipo, y así descargar su enojo porque había “quedado mal” ante sus superiores porque de todas las casuísticas había un caso que rompía.\nFamoso Take a breath y al cabo de unos minutos me junté con él a solas, le hice una pregunta:\n¿Cuántas personas están involucradas en esta funcionalidad?\nEntendió con la pregunta que debía haber esperado y comentarle a todo el equipo responsable lo que había pasado y no agarrar a los primeros que se cruzó en el camino.\nPor último le dije que comprendía, pero no compartía su enojo ni como lo había manejado.\nQuiero aclarar que mi intención no es juzgar, sino compartir que aprendí de ese error, de nuevo:\nAscender no debería ser la única o principal meta, se corre el riesgo de estar bajo una enorme presión por no estar a la altura de las circunstancias. Compartir y adquirir conocimiento debería ser la guía.\nPensar y realizar test antes de implementar cualquier cosa es la guía fundamental para entender el comportamiento de nuestros sistemas o del conocimiento del dominio que tenemos hasta el momento. Siempre y repitamos, siempre, es una ganancia en el tiempo.\nPara finalizar entiendo que voy a seguir cometiendo errores y compartiendo la experiencia que me dejaron, eso no me hace ni peor ni mejor que nadie.\nEstoy convencido que es una sana manera de transitar la vida donde lo “normal” es mostrarnos “exitosos” o como me gusta hacer paralelismos con el fútbol, “jugar para la tribuna”, pero a fin de cuenta es solo una apariencia.\n¡Gracias por leerme! 👋🏽"},"title":"De los errores se aprende, si se comparten, se crece"},"/blog/es/posts/technical-debt/":{"data":{"":"En la siguiente publicación vamos a repensar un concepto comúnmente encontrado y avalado en la industria de la tecnología, la deuda técnica.","conclusiones#Conclusiones":"La deuda técnica es muy agotadora para los equipos y donde hoy pensamos que estamos ganando tiempo te aseguro que pronto, muy pronto, se pierde agilidad y velocidad en el desarrollo.\nSe puede evitar en la mayoría de los casos y no la aceptemos como algo natural.\nPara finalizar espero que repensemos juntos la “deuda técnica” y que nos incomode tenerla.\n¡Gracias por leerme! 👋🏽","distinta-vara#Distinta vara":"Imaginemos que necesitamos pintar el exterior de nuestra casa y decidimos contratar a un profesional para que realice el trabajo.\nDespués de consultar por varios presupuestos decidimos contratar los servicios de “x” para que se encargue del trabajo.\nAl cabo de unos dias “x” nos comenta:\n- El trabajo está terminado.\nNos paramos en el frente de la casa y notamos que alrededor de los marcos de la ventana no está pintado en algunos casos.\nAl notar esto le preguntamos a “x” porque no pinto alrededor de los marcos de la ventana, a lo que nos responde:\n- Disculpá, deuda técnica que la podemos atacar a futuro.\n¿Qué sentirías si te encontrás con una situación asi?\n¿Por qué en el contexto de la tecnología avalamos tener deuda técnica?","repensemos#Repensemos":"En tecnología es muy común encontrarnos con este escenario y lamentablemente lo naturalizamos y como comente en otra publicación donde hablo entre otras cosas sobre la importancia de documentar y hacer test, es algo común que siempre veo como “deuda técnica”, repensando en el ejemplo de pintar la casa creo que nos expone como podemos tener “distinta vara” para medir la misma situación en diferentes contextos.\n¿Por qué es nociva la deuda técnica?\nEn contexto de tests: es extremadamente difícil realizar cambios sin que explote todo. En contexto de documentación: es extremadamente difícil agregar funcionalidad porque la falta de documentación hace que perdamos una cantidad enorme de tiempo tratando de entender como están construidas las cosas. En contexto de equipo: tener deuda técnica hace que el conocimiento quede en las personas y deberíamos siempre, siempre, impulsar que el conocimiento esté distribuido."},"title":"Deuda técnica"},"/blog/es/posts/ticket-hell/":{"data":{"":"","1-cultura-extremadamente-fuerte#1. Cultura extremadamente fuerte":"Tanto a los equipos de infraestructura como a los de QA no se los suele involucrar en el armado de roadmap y sprint de tecnología y producto. En caso de que pase, se lo hace al final de la milla “cuando ya todo está cocinado”.\n¿A dónde apunto con esto?, que si al responsable de infraestructura le llegan dos tickets y tiene que priorizar por cuestiones de capacidad de ejecución, la pregunta obvia:\n¿que ticket priorizo?\nBuena suerte cuando estés ahí, porque para los clientes (en este caso equipo interno de tecnología) lo de ellos es lo más importante del mundo mundial por sobre cualquier cosa.","2-crecimiento-sin-sentido#2. Crecimiento sin sentido":"Supongamos que el punto anterior esta resuelto, de este punto que voy a explicar a continuación no se zafa.\n¿Por qué decimos que el equipo de infraestructura inherentemente tiene que crecer?\nSi caemos en tickets que solo resuelve el equipo de infraestructura a más productos y funcionalidades que tenga la empresa más personas se necesitan del equipo de infraestructura para atacar la demanda de tickets.\nFelicitaciones, creaste un embudo de ejecución.\n¿Solución?, contratar más talento para el equipo de infraestructura.","3-motivación#3. Motivación":"Supongamos que el punto 1 y el 2 están resueltos.\n¿Los integrantes del equipo de infraestructura son humanos verdad?\nDigo esto porque es difícil mantener la motivación si —en un trabajo que es altamente impulsado por la creatividad— acotamos a los integrantes del equipo a “cerrar tickets” sin ningún lugar para la discusión o la doble pregunta.\n¿Qué puede pasar?, rotación alta en el equipo de infra y un malestar en los equipos de tecnología que, si son tóxicos, pueden acusar de bloqueantes o mala experiencia en la gestión de infraestructura al equipo de infra.\nDe esto último ¿qué puede decirte?, Keep Calm y te dejo un gran abrazo.","4-innovación#4. Innovación":"Por último si tenemos resueltos los anteriores 3 puntos es imposible innovar, lisa y llanamente.\n¿Por qué?, un equipo que trabaja simplemente cerrando tickets, abocado solo a participar en un proyecto creando infraestructura, es imposible que pueda innovar.","posicionamiento#Posicionamiento":"¿Cuál es el racional detrás de esta posición firme?\nSe tiene que tener una cultura extremadamente fuerte de punta a punta para poder determinar que ticket es mas importante que otro. El equipo de infraestructura inherentemente tiene que crecer si el equipo de tecnología y producto se expande a nuevas funcionalidades. Es extremadamente difícil mantener al equipo de infraestructura motivado. Es imposible innovar desde el equipo de infraestructura. Existen varios motivos más, pero en este momento me parecen los mas destacables y avanzo en explicar cada uno de ellos.","problema#Problema":"Si solo tenés un martillo todos los problemas se parecen a un clavo\n¿Por qué comienzo con esta conocida frase?, primero quiero dar un poco de historia y luego voy a explicar por qué la menciono.\nEn los equipos de infraestructura en el cual llevo trabajando hace algunos años tuve la gran fortuna de cruzarme con personas importantes que siempre me dijeron.\n- Nunca caigamos en un equipo de infraestructura que trabaje mediante pedidos por tickets","volvamos-al-inicio#Volvamos al inicio":"Si solo tenés un martillo todos los problemas se parecen a un clavo\nA lo largo de post expliqué el racional y los puntos mas importantes en los que va a impactar una metodología de tickets para gestión de infraestructura.\nY quiero dejar en claro que no está mal trabajar por tickets en un equipo de infraestructura, lo que si está definitivamente mal es que la gestión de infraestructura y plataforma se haga por tickets.\n¿Y qué tiene que ver la frase del martillo?, que se implementó mal una metodología ágil en muchas empresas con los equipos de infraestructura y “debemos parar la pelota” para reflexionar por qué no están funcionando bien las cosas en muchos lugares.\n¿Y cómo podemos evitarlo?\nDebemos inyectar una mentalidad de producto a los equipos de infraestructura, ofrecer abstracciones con experiencias de primer nivel del caos de la plataforma subyacente para que los equipos de tecnología de producto sean autosuficientes en la gestión del software y la infraestructura asociada.\nEspero que mi experiencia te haga repensar como formar cultura y procesos de trabajo para los equipos de infraestructura en la empresa si tenés dudas o necesitas discutir algo de lo que escribí estoy encantado de conocerte :)\n¡Hasta pronto! 👋🏽"},"title":"El infierno de los tickets"},"/blog/es/posts/we-should-allmanageteams/":{"data":{"":"Para tener un contexto por si llegaste de casualidad a esta publicación, voy a hablar desde la industria de tecnología, industria profundamente técnica, y cómo liderar equipos, al menos por un lapso de tiempo, puede ayudar al equipo y a vos mismo, tanto de forma profesional como personal.","cómo-impacta-en-tu-ansiedad-y-la-del-equipo-gestionarlo#Cómo impacta en tu ansiedad y la del equipo gestionarlo":"Que tema la ansiedad, soy de Argentina, país con la mayor cantidad de psicólogos por habitante, no es un dato ni bueno ni malo, de hecho hace más de diez años hago terapia para repensarme y repensar a la sociedad.\nTraigo este dato por el tema de la ansiedad y merece un capítulo aparte, como las redes sociales intensificaron este fenómeno.\nPero volvamos al punto que quiero desarrollar, la ansiedad en la gestión de equipos.\nVivimos en una sociedad que está apurada por llegar donde desarrollamos aplicaciones que fomentan compartir videos de segundos porque no soportamos ver un video de más de 30 segundos, donde compartir información se tiene que comprimir en 140 caracteres y si es un thread mas largo uf ni ganas de leerlo. Con este contexto de ansiedad gestionar y desarrollar equipos es un desafío enorme casi titánico diría.\nRobado de una charla de Paenza charla completa\nNo debe haber ningún otro año en la vida de una persona en donde uno incorpore tanta información, aprenda tanto, cambie tanto de calidad de vida, como de 0 a 1 año\n¿A qué voy con este punto?\nQue los aportes que uno vaya haciendo en el equipo y las personas son lentos muuuuy lentos, y en la mayoría de los casos casi imperceptibles y mal que te pese vas a tener que aprender a manejar tu ansiedad y apoyar al equipo para que maneje la suya.\nOtro punto que me parece muy curioso es esa capacidad (y esto también lo comenta el gran Paenza en la charla que te compartí recientemente) de tener cero paciencia para enfrentar un problema, necesitamos respuestas para todo, y si, eso es en parte por la ansiedad que manejamos. Fomentemos la capacidad de resolver problemas no todo en la vida tiene una solución ni hay respuestas para todo.\nFomentemos la capacidad de resolver problemas no todo en la vida tiene una solución ni hay respuestas para todo.\nPor último, en muchas empresas es común encontrarse con procesos de “performance review” dos veces al año y quiero dejar una pregunta en el aire.\n¿Realmente creemos que una persona puede hacer una evolución en un lapso de seis meses?\nY acá cobra mas sentido el fragmento de la charla de Paenza\nNo debe haber ningún otro año en la vida de una persona en donde uno incorpore tanta información, aprenda tanto, cambie tanto de calidad de vida, como de 0 a 1 año","explota-las-virtudes-y-reflexiona-las-mejoras-ambas-son-igual-de-importantes#Explota las virtudes y reflexiona las mejoras, ambas son igual de importantes":"Voy a decir una obviedad, todos tenemos cosas buenas y malas.\nPor favor cuando tengas 1.1 habla de ambas cosas, explota y recalcá las virtudes y reflexiona sobre las mejoras, si solo resaltas las mejoras “o lo que hace mal” es angustiante para la persona que está del otro lado, va a sentir que nada alcanza y nada hace bien.\nPor el contrario, si solo resaltas las virtudes y no te tomas el tiempo para charlar sobre las mejoras no vas a impulsar el cambio y mejora en la vida y carrera de la persona.\nDe nuevo explota las virtudes y reflexiona las mejoras, ambas son igual de importantes.","la-búsqueda-de-feedback-rápido-para-sentirse-valioso#La búsqueda de feedback rápido para sentirse valioso":"Una de las cosas que me hubiese encantado que me aconsejen cuando comencé a gestionar y liderar equipos es buscar cosas que me den un retorno rápido de dopamina.\nCuando uno está liderando y gestionando equipos los procesos de cambio son muy lentos y uno tiende a pensar que es inservible y que no está haciendo “nada productivo”, calma.\nNo me gustan los tips ni los trucos, pero algo que me sirvió y que me hubiese gustado que me aconsejen es buscar eso que te da felicidad, escribir un fragmento de código o refactorizar, documentar, cualquier cosa, pero algo que te haga sentir que estás aportando valor al equipo, de nuevo, ya liderar y tomar decisiones aportan un valor brutal, la macana es que es imperceptible y uno es humano y necesita sentirse útil y valioso.","lo-obvio-no-todo-tiene-que-pasar-por-vos-ni-tenés-que-estar-al-tanto-de-todo#Lo obvio, no todo tiene que pasar por vos, ni tenés que estar al tanto de todo":"¿Cuántas veces te cruzaste con “líderes tóxicos”?, ¿Qué es tóxico para mí?\nEsas personas que son embudo, todo tiene que pasar por ellas, todo el tiempo necesitan que las diferentes decisiones pasen por ellas y casi el 100% de las veces predominan sus decisiones.\n¿Qué nos propongo?\nImpulsemos y acompañemos el crecimiento de las personas del equipo y al equipo, compartamos conocimiento y estemos abiertos a nuevas y ideas y propuestas.\nPersonalmente hablando el día que me fuí de vacaciones y todo siguió su rumbo, es más sacamos funcionalidades, las comunicamos y al volver no se tiene esa sensación de FOMO es la gloria.\nTe dejo la pregunta en el contexto de cuando volvés o alguien vuelve de vacaciones y en la daily se escucha.\nUff estuve revisando todos los emails y mensajes de slack para ponerme al día\n¿No debería seguir su curso natural los proyectos sin que estés vos presente?","se-vos-mismo-no-gestiones-desde-lo-libros#Se vos mismo, no gestiones desde lo libros":"Por último y también puede ser una obviedad, pero se vos mismo, se siente a kilómetros de distancia cuando alguien te está hablando desde un discurso preparado o desde tips de un libro de liderazgo.\nTodos estamos y continuamos aprendiendo, vos también.","tengo-un-crecimiento-personal#¿Tengo un crecimiento personal?":"¿Qué pasaría si lideramos un equipo al menos por un año?\nAunque no sea el path de carrera que elegiste, liderar y gestionar un equipo va a brindarte herramientas importantísimas, más importantes que cualquier patrón de diseño y arquitectura de software.\nVas a aprender a controlar tus emociones, egos, frustraciones, vas a aprender a negociar, confiar, aconsejar, direccionar, pedir perdón y mostrarte vulnerable, podría seguir por un rato largo, pero creo que me explico el nivel de información y herramientas que puede brindarte.\nLa respuesta es sí, vas a tener un crecimiento personal y claramente profesional."},"title":"Todos deberíamos gestionar equipos"},"/blog/es/posts/when-the-context-matter/":{"data":{"":"La siguiente publicación se podría decir que es una continuación de otra donde hablamos de como tener imágenes livianas nos ayuda en muchos aspectos, si aún no pudiste leerla acá te dejo el acceso.\nHoy vamos a realizar una pequeña, pero importante mejora, y vamos a descubrir porque la estamos realizando.","preámbulo#Preámbulo":"Como última propuesta en la publicación que compartí anteriormente nos quedamos en este punto:\nDockerfile 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 # First layer use to build a Golang binary FROM golang:1.18-alpine3.16 AS builder WORKDIR /build COPY go.mod go.sum ./ RUN go mod download \u0026\u0026 go mod verify COPY . ./ RUN GOOS=linux go build -o ./myapp ./path/to/main # Final layer expose app to minimal docker image FROM alpine:3.16.0 COPY --from=builder /build/myapp /myapp ENTRYPOINT [\"/myapp\"] Si tenemos como premisa que la tecnología de containers y su popularización con Docker es disruptiva es en gran medida por los beneficios de poder construir en diferentes lugares y no encontrarnos con sorpresas cuando iniciamos la aplicación que está contenida en el container, te invito a que pensemos durante unos segundos/minutos o el tiempo que necesitemos.\n¿Se puede realizar una mejora en la imagen para la aplicación de Golang?\nLa respuesta es si, ¡manos a la obra!","propuestaaprendizaje#Propuesta/aprendizaje":"Golang posee una característica que es realmente poderosa, y no estoy hablando de las goroutines, y es la gran virtud de poder realizar compilación cruzada.\n¿Qué es compilación cruzada?, es la característica de poder compilar desde un host con una determinada arquitectura y sistema operativo (SO) el binario para otra arquitectura o SO.\nEntonces para ser un poco más específicos podemos desde un host con SO = linux y arquitectura = amd64, compilar un binario para SO = windows, arquitectura = 386 😲.\nImaginemos ahora que donde corremos los contenedores para nuestras aplicaciones el cómputo es linux como SO y con arquitectura amd64.\nCon esto en mente realicemos una pequeña, pero importante mejora en nuestro Dockerfile.\nDockerfile 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 # First layer use to build a Golang binary FROM golang:1.18-alpine3.16 AS builder WORKDIR /build COPY go.mod go.sum ./ RUN go mod download \u0026\u0026 go mod verify ENV GO111MODULE=on \\ CGO_ENABLED=0 \\ GOOS=linux \\ GOARCH=amd64 COPY . ./ RUN go build -o ./myapp ./path/to/main # Final layer expose app to minimal docker image FROM alpine:3.16.0 COPY --from=builder /build/myapp /myapp ENTRYPOINT [\"/myapp\"] Primero analicemos el cambio y porque lo realizamos.\nENV GO111MODULE=on \\ CGO_ENABLED=0 \\ GOOS=linux \\ GOARCH=amd64 CGO_ENABLED=0 desactivamos CGO\nGOARCH=amd64 indicamos la arquitectura\nGOOS=linux indicamos el SO\nTodo bien luispi, ¿pero qué ganancia obtuvimos?\nAsegurarnos de compilar la aplicación para el entorno en el que va a ser ejecutado nos va a prevenir varios dolores de cabeza o “troubleshooting”, y de más esta decir que ya no nos importa donde vamos a hacerlo (cualquiera sea nuestro canal de integración continua), porque realizando la compilación, de nuevo, para el entorno en que va a ser ejecutado, nos quedamos tranquilos de que estamos acortando el margen de contratiempos.\nPara no aburrirte y por el momento hagamos una pausa.\n¡Que pase bien! 👋🏽"},"title":"Cuando el contexto importa"}}